docs/notes/bash.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Bash</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="/static/main.css" />
</head>
<body>
<div id="preamble" class="status">
<nav id="navbar" class="cf">
  <ul class="cf">
    <li class="fl">
      <a href="/">cfclrk</a>
    </li>
    <li class="fr">
      <a href="/articles/home.html">Articles</a>
    </li>
    <li class="fr">
      <a href="/notes/home.html">Notes</a>
    </li>
	<li class="fr">
      <a href="/cloudformation/home.html">CloudFormation</a>
    </li>
  </ul>
</nav>
</div>
<div id="content" class="content">
<header>
<h1 class="title">Bash</h1>
</header><nav id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org7e2c0cd">Style</a></li>
<li><a href="#org86b3b3e">Function Parameters</a>
<ul>
<li><a href="#org9a321ba">Using [[ (new-test)</a></li>
<li><a href="#org1a5dc03">Using [ (test)</a></li>
<li><a href="#org9fee011">if-else</a></li>
</ul>
</li>
<li><a href="#orgc7512da">Set</a>
<ul>
<li><a href="#orgf8bfeaf">set -u</a></li>
</ul>
</li>
<li><a href="#orgb4c35e8">Script Arguments</a></li>
<li><a href="#org15321fd">Script Options</a>
<ul>
<li><a href="#orga57d429">getopts</a></li>
</ul>
</li>
<li><a href="#org70c7ca2">Heredocs</a>
<ul>
<li><a href="#org39b51bf">Whitespace</a></li>
<li><a href="#org1ba0300">Interpolation</a>
<ul>
<li><a href="#orge3e10d4">with interpolation</a></li>
<li><a href="#org1a4b638">without interpolation</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgc9a2767">Verify Environment Variables</a></li>
<li><a href="#org8e6fe39">Parameter Expansion</a>
<ul>
<li><a href="#org12914c9">Resources</a></li>
<li><a href="#orgc1209c3">:-</a></li>
<li><a href="#org2001bfc">+</a></li>
<li><a href="#orgc193f41">##</a></li>
</ul>
</li>
<li><a href="#orgd8681db">Arrays</a>
<ul>
<li><a href="#org4c9a9b3">* vs @</a></li>
<li><a href="#org1cc52aa">Basic</a></li>
<li><a href="#org6740f24">Length</a></li>
<li><a href="#orgf5bb7b5">Pipe array to xargs</a></li>
</ul>
</li>
<li><a href="#org0cb3e88">Associative Arrays</a>
<ul>
<li><a href="#org7862d73">Using cut</a></li>
</ul>
</li>
<li><a href="#orga23a280">Range</a></li>
<li><a href="#org0d22012">Strings, Echo, and Printf</a>
<ul>
<li><a href="#org23d9663">Echo adds a newline</a></li>
<li><a href="#orgad85e0c">Print a multiline string</a></li>
</ul>
</li>
<li><a href="#orgdc29e29">Numbered List</a></li>
</ul>
</div>
</nav>

<div id="outline-container-org7e2c0cd" class="outline-2">
<h2 id="org7e2c0cd"><a href="#org7e2c0cd">Style</a></h2>
<div class="outline-text-2" id="text-org7e2c0cd">
<ul class="org-ul">
<li><p>
Google <a href="https://google.github.io/styleguide/shellguide.html">Shell Style Guide</a>
</p>

<p>
Interestingly, says to use <code>#!/bin/bash</code>.
</p></li>

<li><p>
<a href="https://github.com/azet/community_bash_style_guide">Community Bash Style Guide</a>
</p>

<p>
One person's opinions, but I like them.
</p></li>
</ul>
</div>
</div>

<div id="outline-container-org86b3b3e" class="outline-2">
<h2 id="org86b3b3e"><a href="#org86b3b3e">Function Parameters</a></h2>
<div class="outline-text-2" id="text-org86b3b3e">
<p>
How to specify bash functions with required parameters. When the function is
applied to the wrong number of arguments, a non-0 exit status should be
returned.
</p>

<p>
One important question: is the empty string <code>""</code> a valid parameter?
</p>
</div>

<div id="outline-container-org9a321ba" class="outline-3">
<h3 id="org9a321ba"><a href="#org9a321ba">Using [[ (new-test)</a></h3>
<div class="outline-text-3" id="text-org9a321ba">
<p>
The double-bracket <code>[[</code> syntax is called "new-test".
</p>

<p>
<code>-n</code> is a string comparison operator that tests if a string is not null zero-length.
</p>

<div class="org-src-container">
<pre class="src src-sh" id="orga43b4ae">foo() {
    [[ -n "$1" ]] || {
        echo "Error: param 1 is required"
        return 1
    }
    echo "Param is: $1"
}

foo
foo ""
foo bar
</pre>
</div>
</div>
</div>

<div id="outline-container-org1a5dc03" class="outline-3">
<h3 id="org1a5dc03"><a href="#org1a5dc03">Using [ (test)</a></h3>
<div class="outline-text-3" id="text-org1a5dc03">
<p>
Same as above, but not as good. For more info, see <a href="http://mywiki.wooledge.org/BashFAQ/031">FAQ</a>: "What is the
difference between <code>test</code>, <code>[</code> and <code>[[</code>?"
</p>

<div class="org-src-container">
<pre class="src src-sh">foo() {
    [ -n "$1" ] || {
        echo "Error: param 1 is required"
        return 1
    }
}
</pre>
</div>

<p>
Note that <code>[</code> <code>]</code> is an alias for <code>test</code>. The above example could be written
as:
</p>

<div class="org-src-container">
<pre class="src src-sh">foo() {
    a=${1-}
    test -n "$a" || {
        echo "Error: a is required"
        return 1
    }
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org9fee011" class="outline-3">
<h3 id="org9fee011"><a href="#org9fee011">if-else</a></h3>
<div class="outline-text-3" id="text-org9fee011">
<div class="org-src-container">
<pre class="src src-sh">foo() {
    if [ -z ${1+x} ]; then
        echo "Error: param 1 is required"
        return 1
    else
        local a=$1
    fi
    echo "a is '$a'"
}

foo
foo ""
foo bar
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgc7512da" class="outline-2">
<h2 id="orgc7512da"><a href="#orgc7512da">Set</a></h2>
<div class="outline-text-2" id="text-orgc7512da">
</div>
<div id="outline-container-orgf8bfeaf" class="outline-3">
<h3 id="orgf8bfeaf"><a href="#orgf8bfeaf">set -u</a></h3>
<div class="outline-text-3" id="text-orgf8bfeaf">
<p>
Without <code>set -u</code> this works fine and prints nothing, even though <code>foo</code> is not
bound.
</p>

<div class="org-src-container">
<pre class="src src-bash">echo $foo
</pre>
</div>

<p>
This produces an error: "bash: line 2: foo: unbound variable" (TODO: org mode
to print this).
</p>

<div class="org-src-container">
<pre class="src src-bash">set -u
echo $foo
</pre>
</div>

<p>
Works with <code>eval</code>.
</p>

<div class="org-src-container">
<pre class="src src-bash">set -u
vars="FOO=foo BAR=bar"
eval $vars
echo $FOO
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgb4c35e8" class="outline-2">
<h2 id="orgb4c35e8"><a href="#orgb4c35e8">Script Arguments</a></h2>
<div class="outline-text-2" id="text-orgb4c35e8">
<p>
Same patterns as function parameters can be used.
</p>

<div class="org-src-container">
<pre class="src src-sh">if [ -z ${1+x} ]; then
    echo "arg 1 (foo) is required"
    exit 1
fi
foo=$1
echo "foo is: '$foo'"
</pre>
</div>
</div>
</div>

<div id="outline-container-org15321fd" class="outline-2">
<h2 id="org15321fd"><a href="#org15321fd">Script Options</a></h2>
<div class="outline-text-2" id="text-org15321fd">
</div>
<div id="outline-container-orga57d429" class="outline-3">
<h3 id="orga57d429"><a href="#orga57d429">getopts</a></h3>
<div class="outline-text-3" id="text-orga57d429">
<p>
See home/bin/ssm script for a good example.
</p>

<div class="org-src-container">
<pre class="src src-sh">showHelp() {
    cat &lt;&lt;END
Usage: $(basename "$0") [-p profile]
END
}

while getopts :hp: arg; do
    case ${arg} in
        h)
            showHelp
            exit 0
            ;;
        p)
            profile="$OPTARG"
            ;;
        \?)
            echo "Invalid option: -$OPTARG" &gt;&amp;2
            exit 1
            ;;
        :)
            echo "Option -$OPTARG requires an argument" &gt;&amp;2
            exit 1
            ;;
    esac
done
shift $((OPTIND -1))

# Define default option values
profile=${profile:="chrisc"}

aws="aws --profile $profile --region us-east-1"
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org70c7ca2" class="outline-2">
<h2 id="org70c7ca2"><a href="#org70c7ca2">Heredocs</a></h2>
<div class="outline-text-2" id="text-org70c7ca2">
</div>
<div id="outline-container-org39b51bf" class="outline-3">
<h3 id="org39b51bf"><a href="#org39b51bf">Whitespace</a></h3>
<div class="outline-text-3" id="text-org39b51bf">
<p>
Use <code>&lt;&lt;-</code>. Each line in the HEREDOC has to begin with a TAB. Having trouble
getting this working with org-babel.
</p>

<div class="org-src-container">
<pre class="src src-sh">foo="bar"
a=$(cat &lt;&lt;-EOF
hello
$foo
EOF
)
echo "$a"
</pre>
</div>
</div>
</div>

<div id="outline-container-org1ba0300" class="outline-3">
<h3 id="org1ba0300"><a href="#org1ba0300">Interpolation</a></h3>
<div class="outline-text-3" id="text-org1ba0300">
<p>
A heredoc can interpolate variable names to values, or the whole heredoc can
be taken completely literally without any interpolation. The difference is
whether the limit string has single quotes around it.
</p>
</div>

<div id="outline-container-orge3e10d4" class="outline-4">
<h4 id="orge3e10d4"><a href="#orge3e10d4">with interpolation</a></h4>
<div class="outline-text-4" id="text-orge3e10d4">
<div class="org-src-container">
<pre class="src src-sh">foo="fooo"
a=$(cat &lt;&lt;EOF
hello
$foo
EOF
)
echo "$a"
</pre>
</div>

<p>
Note, this also works with single quotes!
</p>

<div class="org-src-container">
<pre class="src src-sh">foo="fooo"
a=$(cat &lt;&lt;EOF
hello
'$foo'
EOF
)
echo "$a"
</pre>
</div>
</div>
</div>

<div id="outline-container-org1a4b638" class="outline-4">
<h4 id="org1a4b638"><a href="#org1a4b638">without interpolation</a></h4>
<div class="outline-text-4" id="text-org1a4b638">
<div class="org-src-container">
<pre class="src src-sh">foo="bar"
a=$(cat &lt;&lt;'EOF'
hello
$foo
EOF
)
echo "$a"
</pre>
</div>
</div>
</div>
</div>
</div>

<div id="outline-container-orgc9a2767" class="outline-2">
<h2 id="orgc9a2767"><a href="#orgc9a2767">Verify Environment Variables</a></h2>
<div class="outline-text-2" id="text-orgc9a2767">
<p>
Verify some environment variables exist.
</p>

<div class="org-src-container">
<pre class="src src-sh">: "${FOO:?FOO is not set}"
: "${BAR:?BAR is not set}"
</pre>
</div>
</div>
</div>

<div id="outline-container-org8e6fe39" class="outline-2">
<h2 id="org8e6fe39"><a href="#org8e6fe39">Parameter Expansion</a></h2>
<div class="outline-text-2" id="text-org8e6fe39">
</div>
<div id="outline-container-org12914c9" class="outline-3">
<h3 id="org12914c9"><a href="#org12914c9">Resources</a></h3>
<div class="outline-text-3" id="text-org12914c9">
<ul class="org-ul">
<li>GNU <a href="https://www.gnu.org/savannah-checkouts/gnu/bash/manual/">Bash docs</a> section on <a href="https://www.gnu.org/software/bash/manual/bashref.html#Shell-Parameter-Expansion">paremeter expansion</a></li>
<li><i>The Open Group</i> has some excellent <a href="https://pubs.opengroup.org/onlinepubs/9699919799">POSIX documentation</a> with a section on
<a href="http://pubs.opengroup.org/onlinepubs/9699919799/utilities/V3_chap02.html#tag_18_06_02">parameter expansion</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgc1209c3" class="outline-3">
<h3 id="orgc1209c3"><a href="#orgc1209c3">:-</a></h3>
<div class="outline-text-3" id="text-orgc1209c3">
<p>
<a href="https://pubs.opengroup.org/onlinepubs/9699919799/utilities/V3_chap02.html#tag_18_06_02">Docs</a> for <code>${parameter:-[word]}</code>
</p>

<blockquote>
<p>
If <i>parameter</i> is unset or null, the expansion of <i>word</i> (or an empty string
if <i>word</i> is omitted) shall be substituted; otherwise, the value of
<i>parameter</i> shall be substituted.
</p>
</blockquote>

<div class="org-src-container">
<pre class="src src-bash">var=""
if [ -z ${var:-x"} ]; then
    echo "var is unset"
else
    echo "var is set to '$var'"
fi
</pre>
</div>

<div class="org-src-container">
<pre class="src src-sh">if [ -z ${var:-"foo"} ]; then
    echo "var is unset"
else
    echo "var is set to '$var'"
fi
</pre>
</div>
</div>
</div>

<div id="outline-container-org2001bfc" class="outline-3">
<h3 id="org2001bfc"><a href="#org2001bfc">+</a></h3>
<div class="outline-text-3" id="text-org2001bfc">
<p>
<a href="https://pubs.opengroup.org/onlinepubs/9699919799/utilities/V3_chap02.html#tag_18_06_02">Docs</a> for <code>${parameter:+[word]}</code>
</p>

<blockquote>
<p>
If <i>parameter</i> is unset or null, null shall be substituted; otherwise, the
expansion of <i>word</i> (or an empty string if <i>word</i> is omitted) shall be
substituted.
</p>
</blockquote>

<p>
<code>-z</code> is a <a href="https://tldp.org/LDP/abs/html/comparison-ops.html">comparison operator</a> that tests if the argument is null or empty.
</p>

<div class="org-src-container">
<pre class="src src-sh">var=""
if [ -z ${var+x} ]; then
    echo "var is unset"
else
    echo "var is set to '$var'"
fi
</pre>
</div>

<p>
In this case, <code>var</code> is the empty string, which is not "unset or null".
Therefore the <code>+</code> parameter expansion expands this to <code>x</code> (which passes the
<code>-z</code> check).
</p>

<div class="org-src-container">
<pre class="src src-sh">if [ -z ${var+x} ]; then
    echo "var is unset"
else
    echo "var is set to '$var'"
fi
</pre>
</div>

<p>
In this case, <code>var</code> has not been declared, so it is "unset or null". The <code>+</code>
parameter expansion expands it to <code>null</code>.
</p>

<div class="org-src-container">
<pre class="src src-sh">var=""
if [ -z ${var+} ]; then
    echo "var is unset"
else
    echo "var is set to '$var'"
fi
</pre>
</div>

<p>
In this case we leave the <code>word</code> spot empty in the parameter expansion, so if
<code>var</code> is empty, it is subsituted by an empty string. Now the <code>-z</code> test sees an
empty argument, and this prints out <code>var is unset</code>.
</p>
</div>
</div>

<div id="outline-container-orgc193f41" class="outline-3">
<h3 id="orgc193f41"><a href="#orgc193f41">##</a></h3>
<div class="outline-text-3" id="text-orgc193f41">
<p>
Remove largest prefix pattern.
</p>

<div class="org-src-container">
<pre class="src src-sh">a_list=("foo/aa.foo" "bar/ab.foo" "baz/ac.foo")
for a in ${a_list[@]}; do
    # The "*/" is a regex
    echo ${a##*/}
done
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgd8681db" class="outline-2">
<h2 id="orgd8681db"><a href="#orgd8681db">Arrays</a></h2>
<div class="outline-text-2" id="text-orgd8681db">
</div>
<div id="outline-container-org4c9a9b3" class="outline-3">
<h3 id="org4c9a9b3"><a href="#org4c9a9b3">* vs @</a></h3>
<div class="outline-text-3" id="text-org4c9a9b3">
<p>
See <a href="https://stackoverflow.com/a/3355375/340613">this StackOverflow answer</a>.
</p>

<blockquote>
<p>
The difference between <code>[@]</code> and <code>[*]</code>-expanded arrays in double-quotes is
that <code>"${myarray[@]}"</code> leads to each element of the array being treated as a
separate shell-word, while <code>"${myarray[*]}"</code> results in a single shell-word
with all of the elements of the array separated by spaces (or whatever the
first character of <code>IFS</code> is).
</p>

<p>
Usually, the <code>[@]</code> behavior is what you want.
</p>
</blockquote>
</div>
</div>

<div id="outline-container-org1cc52aa" class="outline-3">
<h3 id="org1cc52aa"><a href="#org1cc52aa">Basic</a></h3>
<div class="outline-text-3" id="text-org1cc52aa">
<div class="org-src-container">
<pre class="src src-sh">arr=("foo" "bar" "baz")
echo ${arr[@]}
</pre>
</div>

<div class="org-src-container">
<pre class="src src-sh">arr=("foo" "bar" "baz")
for x in "${arr[@]}"; do
    echo $x
done
</pre>
</div>
</div>
</div>

<div id="outline-container-org6740f24" class="outline-3">
<h3 id="org6740f24"><a href="#org6740f24">Length</a></h3>
<div class="outline-text-3" id="text-org6740f24">
<div class="org-src-container">
<pre class="src src-sh">arr=("foo" "bar" "baz")
echo ${#arr[@]}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgf5bb7b5" class="outline-3">
<h3 id="orgf5bb7b5"><a href="#orgf5bb7b5">Pipe array to xargs</a></h3>
<div class="outline-text-3" id="text-orgf5bb7b5">
<p>
Start a subprocess per element in an array, where each subprocess runs <code>$script</code>.
</p>

<div class="org-src-container">
<pre class="src src-sh">script=$(cat &lt;&lt;"EOF"
echo "some {}"
EOF
)
arr=("foo" "bar" "baz")
printf "%s\n" "${arr[@]}" \
    | xargs -n 1 \
            -P ${#arr[@]} \
            -I {} \
            bash -c "$script"
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org0cb3e88" class="outline-2">
<h2 id="org0cb3e88"><a href="#org0cb3e88">Associative Arrays</a></h2>
<div class="outline-text-2" id="text-org0cb3e88">
</div>
<div id="outline-container-org7862d73" class="outline-3">
<h3 id="org7862d73"><a href="#org7862d73">Using cut</a></h3>
<div class="outline-text-3" id="text-org7862d73">
<div class="org-src-container">
<pre class="src src-sh">arr=("key1,val1",
     "key2,val2",
     "key3,val3")

for i in "${arr[@]}"; do
    k=$(echo "$i" | cut -d, -f 1)
    v=$(echo "$i" | cut -d, -f 2)
    echo "Key is $k and val is $v"
done
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orga23a280" class="outline-2">
<h2 id="orga23a280"><a href="#orga23a280">Range</a></h2>
<div class="outline-text-2" id="text-orga23a280">
<div class="org-src-container">
<pre class="src src-bash">for i in {1..5}; do
    echo $i
done
</pre>
</div>
</div>
</div>

<div id="outline-container-org0d22012" class="outline-2">
<h2 id="org0d22012"><a href="#org0d22012">Strings, Echo, and Printf</a></h2>
<div class="outline-text-2" id="text-org0d22012">
</div>
<div id="outline-container-org23d9663" class="outline-3">
<h3 id="org23d9663"><a href="#org23d9663">Echo adds a newline</a></h3>
<div class="outline-text-3" id="text-org23d9663">
<p>
Notice that <code>echo</code> adds a newline.
</p>

<div class="org-src-container">
<pre class="src src-sh">echo "foo" | od -c
</pre>
</div>

<p>
While <code>printf</code> does not.
</p>

<div class="org-src-container">
<pre class="src src-sh">printf "foo" | od -c
</pre>
</div>
</div>
</div>

<div id="outline-container-orgad85e0c" class="outline-3">
<h3 id="orgad85e0c"><a href="#orgad85e0c">Print a multiline string</a></h3>
<div class="outline-text-3" id="text-orgad85e0c">
<p>
<code>echo $a</code> prints a heredoc on one line, while <code>echo "$a"</code> preserves the
newlines in the heredoc. Why is that?
</p>

<div class="org-src-container">
<pre class="src src-sh">a=$(cat &lt;&lt;EOF
hello
world
EOF
)
echo $a
echo "---"
echo "$a"
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgdc29e29" class="outline-2">
<h2 id="orgdc29e29"><a href="#orgdc29e29">Numbered List</a></h2>
<div class="outline-text-2" id="text-orgdc29e29">
<div class="org-src-container">
<pre class="src src-bash">echo $PATH | tr ":" "\n" | nl
</pre>
</div>
</div>
</div>
</div>
</body>
</html>